20241105T170010--kdoc-274-『rfcの読み方』__draft_book.org
:properties:
:ID: 20241105T170010
:mtime:    20241105203353
:ctime:    20241105170036
:end:
#+title:      KDOC 274: 『RFCの読み方』
#+date:       [2024-11-05 Tue 17:00]
#+filetags:   :draft:book:
#+identifier: 20241105T170010

# (denote-rename-file-using-front-matter (buffer-file-name) 0)
# (save-excursion (while (re-search-backward ":draft" nil t) (replace-match "")))
# (flush-lines "^\\#\s.+?")

# ====ポリシー。
# 1ファイル1アイデア。
# 1ファイルで内容を完結させる。
# 常にほかのエントリとリンクする。
# 自分の言葉を使う。
# 参考文献を残しておく。
# 文献メモの場合は、感想と混ぜないこと。1つのアイデアに反する
# ツェッテルカステンの議論に寄与するか。それで本を書けと言われて書けるか
# 頭のなかやツェッテルカステンにある問いとどのようにかかわっているか
# エントリ間の接続を発見したら、接続エントリを追加する。カード間にあるリンクの関係を説明するカード。
# アイデアがまとまったらアウトラインエントリを作成する。リンクをまとめたエントリ。
# エントリを削除しない。古いカードのどこが悪いかを説明する新しいカードへのリンクを追加する。
# 恐れずにカードを追加する。無意味の可能性があっても追加しておくことが重要。
# 個人の感想・意思表明ではない。事実や書籍情報に基づいている

# ====永久保存メモのルール。
# 自分の言葉で書く。
# 後から読み返して理解できる。
# 他のメモと関連付ける。
# ひとつのメモにひとつのことだけを書く。
# メモの内容は1枚で完結させる。
# 論文の中に組み込み、公表できるレベルである。

# ====水準を満たす価値があるか。
# その情報がどういった文脈で使えるか。
# どの程度重要な情報か。
# そのページのどこが本当に必要な部分なのか。
# 公表できるレベルの洞察を得られるか

# ====フロー。
# 1. 「走り書きメモ」「文献メモ」を書く
# 2. 1日1回既存のメモを見て、自分自身の研究、思考、興味にどのように関係してくるかを見る
# 3. 追加すべきものだけ追加する

* この文書のステータス
:LOGBOOK:
CLOCK: [2024-11-05 Tue 18:46]--[2024-11-05 Tue 19:11] =>  0:25
CLOCK: [2024-11-05 Tue 18:07]--[2024-11-05 Tue 18:32] =>  0:25
:END:
- 作成
  - [ ] <署名>
# (progn (kill-line -1) (insert (format "  - [X] %s 貴島" (format-time-string "%Y-%m-%d"))))
- レビュー
  - [ ] <署名>
# (progn (kill-line -1) (insert (format "  - [X] %s 貴島" (format-time-string "%Y-%m-%d"))))

# チェックリスト ================
# 関連をつけた。
# タイトルがフォーマット通りにつけられている。
# 内容をブラウザに表示して読んだ(作成とレビューのチェックは同時にしない)。
# 文脈なく読めるのを確認した。
# おばあちゃんに説明できる。
# いらない見出しを削除した。
# タグを適切にした。
# すべてのコメントを削除した。
* 概要

[[https://amzn.to/3UCjZaj][『RFCの読み方: インターネット技術の公式仕様書』]]はRFCの読み方を解説する本である。

* メモ
- RFCはけっして削除されることはない(p19)
- 基礎を学ぶのに最適なRFC1178。コンピュータの命名方法
  - つけてはいけない名前の例
  - おすすめのつけかた。テーマのある名前をつけること。あまり使われない、数の多いものだとなおよい。色、神話上の人物の名前、元素名、など
- セキュリティに関する考察はRFCでは必須のものとされている。なのでエッセイのRFCであっても章は存在する(p70)
- ユーザーエージェント(メーラー)からメールを送るときには、直接宛先のメールサーバではなく、SMTPサーバに送るのが一般的である。送信待ちとなるのを防いだり、再送機能を利用するためにSMTPに任せる(p89)
- 1回読んでわかりにくかったときは、箇条書きにして文を細かく分けて考えるとよい(p89)
- 待機と接続の確立(p91)
  - 「待機(listing)」ポートを開きそこへの接続を待つこと。TCP/IPの通信ではコンピュータは1~65535までの番号が付いたポートを持っている
  - POP3は110番ポートを開きそこでの接続されるのを待つ
  - クライアントは自分自身のポートのうち未使用のポートを開き、そのポートとサーバ側の110番をつなげようとする。こうしてクライアントのポートからサーバの110番ポートのデータが流れるようになった状態が「接続の確立」である
  - この時点ではまだ声が聞こえるにすぎず、会話にはなっていない
- キーワードは3~4文字で、引数は40文字以下でなければならない(p94)
  - ここから言えるのは、「 **こちらから** 送る引数は40文字以下でなければならない」である。けっして「 **相手から** 送られる引数は40文字以下である」ではない

* 関連
# 関連するエントリ。なぜ関連させたか理由を書く。意味のあるつながりを意識的につくる。
# この事実は自分のこのアイデアとどう整合するか。
# この現象はあの理論でどう説明できるか。
# ふたつのアイデアは互いに矛盾するか、互いを補っているか。
# いま聞いた内容は以前に聞いたことがなかったか。
# メモ y についてメモ x はどういう意味か。
なし。
