20241105T170010--kdoc-274-『rfcの読み方』__draft_book.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-11-06 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 274: 『RFCの読み方』</title>
<meta name="author" content="root" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 274: 『RFCの読み方』</h1>

<div id="outline-container-orgf11c9c1" class="outline-2">
<h2 id="orgf11c9c1"><a href="#orgf11c9c1">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orgf11c9c1">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>

<ul class="org-ul">
<li>レビュー
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org24243ec" class="outline-2">
<h2 id="org24243ec"><a href="#org24243ec">概要</a></h2>
<div class="outline-text-2" id="text-org24243ec">
<p>
<a href="https://amzn.to/3UCjZaj">『RFCの読み方: インターネット技術の公式仕様書』</a>はRFCの読み方を解説する本である。
</p>
</div>
</div>

<div id="outline-container-org5107396" class="outline-2">
<h2 id="org5107396"><a href="#org5107396">メモ</a></h2>
<div class="outline-text-2" id="text-org5107396">
<ul class="org-ul">
<li>RFCはけっして削除されることはない(p19)</li>
<li>基礎を学ぶのに最適なRFC1178。コンピュータの命名方法
<ul class="org-ul">
<li>つけてはいけない名前の例</li>
<li>おすすめのつけかた。テーマのある名前をつけること。あまり使われない、数の多いものだとなおよい。色、神話上の人物の名前、元素名、など</li>
</ul></li>
<li>セキュリティに関する考察はRFCでは必須のものとされている。なのでエッセイのRFCであっても章は存在する(p70)</li>
<li>ユーザーエージェント(メーラー)からメールを送るときには、直接宛先のメールサーバではなく、SMTPサーバに送るのが一般的である。送信待ちとなるのを防いだり、再送機能を利用するためにSMTPに任せる(p89)</li>
<li>1回読んでわかりにくかったときは、箇条書きにして文を細かく分けて考えるとよい(p89)</li>
<li>待機と接続の確立(p91)
<ul class="org-ul">
<li>「待機(listing)」ポートを開きそこへの接続を待つこと。TCP/IPの通信ではコンピュータは1~65535までの番号が付いたポートを持っている</li>
<li>POP3は110番ポートを開きそこでの接続されるのを待つ</li>
<li>クライアントは自分自身のポートのうち未使用のポートを開き、そのポートとサーバ側の110番をつなげようとする。こうしてクライアントのポートからサーバの110番ポートのデータが流れるようになった状態が「接続の確立」である</li>
<li>この時点ではまだ声が聞こえるにすぎず、会話にはなっていない</li>
</ul></li>
<li>キーワードは3~4文字で、引数は40文字以下でなければならない(p94)
<ul class="org-ul">
<li>ここから言えるのは、「 <b><b>こちらから</b></b> 送る引数は40文字以下でなければならない」である。けっして「 <b><b>相手から</b></b> 送られる引数は40文字以下である」ではない</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org820345b" class="outline-2">
<h2 id="org820345b"><a href="#org820345b">関連</a></h2>
<div class="outline-text-2" id="text-org820345b">
<p>
なし。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
